tutorials/pimpleHFDIBFoam/Immersed-BeamBend/Embedded_Beam_Re20_2D-Mesh24720/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                      |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            parabolicInlet;

        codeInclude
        #{
            #include "fvCFD.H"
        #};

        codeOptions
        #{
            -I$(LIB_SRC)/OpenFOAM/lnInclude \
            -I$(LIB_SRC)/finiteVolume/lnInclude \
            -I$(LIB_SRC)/meshTools/lnInclude
        #};

        codeLibs
        #{
            -lOpenFOAM \
            -lfiniteVolume \
            -lmeshTools
        #};

        code
        #{
            const scalar Umean = 1.0;

            const vectorField& Cf = patch().Cf();
            vectorField& Up = *this;

            scalar yMin = GREAT;
            scalar yMax = -GREAT;

            forAll(Cf, i)
            {
                const scalar y = Cf[i].y();
                yMin = min(yMin, y);
                yMax = max(yMax, y);
            }

            reduce(yMin, minOp<scalar>());
            reduce(yMax, maxOp<scalar>());

            const scalar H = yMax - yMin;

            forAll(Up, i)
            {
                const scalar eta = Cf[i].y() - yMin;
                const scalar ux = (6.0*Umean/(H*H))*(eta*H - eta*eta);
                Up[i] = vector(ux, 0.0, 0.0);
            }
        #};
    }

    outlet
    {
        type            zeroGradient;
    }

    rectBlock
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    bottomWall
    {
        type            noSlip;
    }

    topWall
    {
        type            noSlip;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}
// ************************************************************************* //
