tutorials/pimpleHFDIBFoam/Immersed-BeamBend/Embedded_Beam_Re20_2D-Mesh24720/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

simulationType  laminar;