tutorials/pimpleHFDIBFoam/Immersed-BeamBend/Embedded_Beam_Re20_2D-Mesh24720/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM                                        |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           | Body-fitted channel with rectangular blockage    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1;

// Domain:
//   x = [0, 24]
//   y = [0, 4.1]
//   z = [-0.05, 0.05]
//
// Rectangular body removed from mesh:
//   x = [11.9, 12.1]
//   y = [0, 2.0295]
//   z = [-0.05, 0.05]
//
// Strategy:
// - keep slit width fixed at 0.2
// - moderate x-refinement around slit: fine -> finer -> fine
// - keep y-buffer layers above tip

vertices
(
    // z = -0.05, y = 0
    (0      0       -0.05)   // 0
    (8.5    0       -0.05)   // 1
    (10.8   0       -0.05)   // 2
    (11.4   0       -0.05)   // 3
    (11.9   0       -0.05)   // 4
    (12.1   0       -0.05)   // 5
    (12.6   0       -0.05)   // 6
    (13.2   0       -0.05)   // 7
    (15.5   0       -0.05)   // 8
    (24     0       -0.05)   // 9

    // z = -0.05, y = 2.0295
    (0      2.0295  -0.05)   // 10
    (8.5    2.0295  -0.05)   // 11
    (10.8   2.0295  -0.05)   // 12
    (11.4   2.0295  -0.05)   // 13
    (11.9   2.0295  -0.05)   // 14
    (12.1   2.0295  -0.05)   // 15
    (12.6   2.0295  -0.05)   // 16
    (13.2   2.0295  -0.05)   // 17
    (15.5   2.0295  -0.05)   // 18
    (24     2.0295  -0.05)   // 19

    // z = -0.05, y = 2.5
    (0      2.5     -0.05)   // 20
    (8.5    2.5     -0.05)   // 21
    (10.8   2.5     -0.05)   // 22
    (11.4   2.5     -0.05)   // 23
    (11.9   2.5     -0.05)   // 24
    (12.1   2.5     -0.05)   // 25
    (12.6   2.5     -0.05)   // 26
    (13.2   2.5     -0.05)   // 27
    (15.5   2.5     -0.05)   // 28
    (24     2.5     -0.05)   // 29

    // z = -0.05, y = 3.2
    (0      3.2     -0.05)   // 30
    (8.5    3.2     -0.05)   // 31
    (10.8   3.2     -0.05)   // 32
    (11.4   3.2     -0.05)   // 33
    (11.9   3.2     -0.05)   // 34
    (12.1   3.2     -0.05)   // 35
    (12.6   3.2     -0.05)   // 36
    (13.2   3.2     -0.05)   // 37
    (15.5   3.2     -0.05)   // 38
    (24     3.2     -0.05)   // 39

    // z = -0.05, y = 4.1
    (0      4.1     -0.05)   // 40
    (8.5    4.1     -0.05)   // 41
    (10.8   4.1     -0.05)   // 42
    (11.4   4.1     -0.05)   // 43
    (11.9   4.1     -0.05)   // 44
    (12.1   4.1     -0.05)   // 45
    (12.6   4.1     -0.05)   // 46
    (13.2   4.1     -0.05)   // 47
    (15.5   4.1     -0.05)   // 48
    (24     4.1     -0.05)   // 49

    // z = +0.05, y = 0
    (0      0        0.05)   // 50
    (8.5    0        0.05)   // 51
    (10.8   0        0.05)   // 52
    (11.4   0        0.05)   // 53
    (11.9   0        0.05)   // 54
    (12.1   0        0.05)   // 55
    (12.6   0        0.05)   // 56
    (13.2   0        0.05)   // 57
    (15.5   0        0.05)   // 58
    (24     0        0.05)   // 59

    // z = +0.05, y = 2.0295
    (0      2.0295   0.05)   // 60
    (8.5    2.0295   0.05)   // 61
    (10.8   2.0295   0.05)   // 62
    (11.4   2.0295   0.05)   // 63
    (11.9   2.0295   0.05)   // 64
    (12.1   2.0295   0.05)   // 65
    (12.6   2.0295   0.05)   // 66
    (13.2   2.0295   0.05)   // 67
    (15.5   2.0295   0.05)   // 68
    (24     2.0295   0.05)   // 69

    // z = +0.05, y = 2.5
    (0      2.5      0.05)   // 70
    (8.5    2.5      0.05)   // 71
    (10.8   2.5      0.05)   // 72
    (11.4   2.5      0.05)   // 73
    (11.9   2.5      0.05)   // 74
    (12.1   2.5      0.05)   // 75
    (12.6   2.5      0.05)   // 76
    (13.2   2.5      0.05)   // 77
    (15.5   2.5      0.05)   // 78
    (24     2.5      0.05)   // 79

    // z = +0.05, y = 3.2
    (0      3.2      0.05)   // 80
    (8.5    3.2      0.05)   // 81
    (10.8   3.2      0.05)   // 82
    (11.4   3.2      0.05)   // 83
    (11.9   3.2      0.05)   // 84
    (12.1   3.2      0.05)   // 85
    (12.6   3.2      0.05)   // 86
    (13.2   3.2      0.05)   // 87
    (15.5   3.2      0.05)   // 88
    (24     3.2      0.05)   // 89

    // z = +0.05, y = 4.1
    (0      4.1      0.05)   // 90
    (8.5    4.1      0.05)   // 91
    (10.8   4.1      0.05)   // 92
    (11.4   4.1      0.05)   // 93
    (11.9   4.1      0.05)   // 94
    (12.1   4.1      0.05)   // 95
    (12.6   4.1      0.05)   // 96
    (13.2   4.1      0.05)   // 97
    (15.5   4.1      0.05)   // 98
    (24     4.1      0.05)   // 99
);

blocks
(
    // lower row: left of body
    hex (0 1 11 10 50 51 61 60)   (80 38 1) simpleGrading (1 1 1)
    hex (1 2 12 11 51 52 62 61)   (28 38 1) simpleGrading (1 1 1)
    hex (2 3 13 12 52 53 63 62)   (12 38 1) simpleGrading (1 1 1)
    hex (3 4 14 13 53 54 64 63)   (12 38 1) simpleGrading (1 1 1)

    // lower row: right of body
    hex (5 6 16 15 55 56 66 65)   (12 38 1) simpleGrading (1 1 1)
    hex (6 7 17 16 56 57 67 66)   (12 38 1) simpleGrading (1 1 1)
    hex (7 8 18 17 57 58 68 67)   (28 38 1) simpleGrading (1 1 1)
    hex (8 9 19 18 58 59 69 68)   (80 38 1) simpleGrading (1 1 1)

    // first buffer layer above tip: y = 2.0295 -> 2.5
    hex (10 11 21 20 60 61 71 70)   (80 12 1) simpleGrading (1 1 1)
    hex (11 12 22 21 61 62 72 71)   (28 12 1) simpleGrading (1 1 1)
    hex (12 13 23 22 62 63 73 72)   (12 12 1) simpleGrading (1 1 1)
    hex (13 14 24 23 63 64 74 73)   (12 12 1) simpleGrading (1 1 1)
    hex (14 15 25 24 64 65 75 74)   (8  12 1) simpleGrading (1 1 1)
    hex (15 16 26 25 65 66 76 75)   (12 12 1) simpleGrading (1 1 1)
    hex (16 17 27 26 66 67 77 76)   (12 12 1) simpleGrading (1 1 1)
    hex (17 18 28 27 67 68 78 77)   (28 12 1) simpleGrading (1 1 1)
    hex (18 19 29 28 68 69 79 78)   (80 12 1) simpleGrading (1 1 1)

    // second buffer layer: y = 2.5 -> 3.2
    hex (20 21 31 30 70 71 81 80)   (80 18 1) simpleGrading (1 1 1)
    hex (21 22 32 31 71 72 82 81)   (28 18 1) simpleGrading (1 1 1)
    hex (22 23 33 32 72 73 83 82)   (12 18 1) simpleGrading (1 1 1)
    hex (23 24 34 33 73 74 84 83)   (12 18 1) simpleGrading (1 1 1)
    hex (24 25 35 34 74 75 85 84)   (8  18 1) simpleGrading (1 1 1)
    hex (25 26 36 35 75 76 86 85)   (12 18 1) simpleGrading (1 1 1)
    hex (26 27 37 36 76 77 87 86)   (12 18 1) simpleGrading (1 1 1)
    hex (27 28 38 37 77 78 88 87)   (28 18 1) simpleGrading (1 1 1)
    hex (28 29 39 38 78 79 89 88)   (80 18 1) simpleGrading (1 1 1)

    // upper layer: y = 3.2 -> 4.1
    hex (30 31 41 40 80 81 91 90)   (80 24 1) simpleGrading (1 1 1)
    hex (31 32 42 41 81 82 92 91)   (28 24 1) simpleGrading (1 1 1)
    hex (32 33 43 42 82 83 93 92)   (12 24 1) simpleGrading (1 1 1)
    hex (33 34 44 43 83 84 94 93)   (12 24 1) simpleGrading (1 1 1)
    hex (34 35 45 44 84 85 95 94)   (8  24 1) simpleGrading (1 1 1)
    hex (35 36 46 45 85 86 96 95)   (12 24 1) simpleGrading (1 1 1)
    hex (36 37 47 46 86 87 97 96)   (12 24 1) simpleGrading (1 1 1)
    hex (37 38 48 47 87 88 98 97)   (28 24 1) simpleGrading (1 1 1)
    hex (38 39 49 48 88 89 99 98)   (80 24 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 60 50)
            (10 20 70 60)
            (20 30 80 70)
            (30 40 90 80)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (9 59 69 19)
            (19 69 79 29)
            (29 79 89 39)
            (39 89 99 49)
        );
    }

    bottomWall
    {
        type wall;
        faces
        (
            (0 1 51 50)
            (1 2 52 51)
            (2 3 53 52)
            (3 4 54 53)
            (5 6 56 55)
            (6 7 57 56)
            (7 8 58 57)
            (8 9 59 58)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (40 90 91 41)
            (41 91 92 42)
            (42 92 93 43)
            (43 93 94 44)
            (44 94 95 45)
            (45 95 96 46)
            (46 96 97 47)
            (47 97 98 48)
            (48 98 99 49)
        );
    }

    rectBlock
    {
        type wall;
        faces
        (
            (4 14 64 54)    // left face
            (14 15 65 64)   // top face
            (5 55 65 15)    // right face
        );
    }

    frontAndBackPlanes
    {
        type empty;
        faces
        (
            // front z = -0.05
            (0 1 11 10)
            (1 2 12 11)
            (2 3 13 12)
            (3 4 14 13)
            (5 6 16 15)
            (6 7 17 16)
            (7 8 18 17)
            (8 9 19 18)

            (10 11 21 20)
            (11 12 22 21)
            (12 13 23 22)
            (13 14 24 23)
            (14 15 25 24)
            (15 16 26 25)
            (16 17 27 26)
            (17 18 28 27)
            (18 19 29 28)

            (20 21 31 30)
            (21 22 32 31)
            (22 23 33 32)
            (23 24 34 33)
            (24 25 35 34)
            (25 26 36 35)
            (26 27 37 36)
            (27 28 38 37)
            (28 29 39 38)

            (30 31 41 40)
            (31 32 42 41)
            (32 33 43 42)
            (33 34 44 43)
            (34 35 45 44)
            (35 36 46 45)
            (36 37 47 46)
            (37 38 48 47)
            (38 39 49 48)

            // back z = +0.05
            (50 60 61 51)
            (51 61 62 52)
            (52 62 63 53)
            (53 63 64 54)
            (55 65 66 56)
            (56 66 67 57)
            (57 67 68 58)
            (58 68 69 59)

            (60 70 71 61)
            (61 71 72 62)
            (62 72 73 63)
            (63 73 74 64)
            (64 74 75 65)
            (65 75 76 66)
            (66 76 77 67)
            (67 77 78 68)
            (68 78 79 69)

            (70 80 81 71)
            (71 81 82 72)
            (72 82 83 73)
            (73 83 84 74)
            (74 84 85 75)
            (75 85 86 76)
            (76 86 87 77)
            (77 87 88 78)
            (78 88 89 79)

            (80 90 91 81)
            (81 91 92 82)
            (82 92 93 83)
            (83 93 94 84)
            (84 94 95 85)
            (85 95 96 86)
            (86 96 97 87)
            (87 97 98 88)
            (88 98 99 89)
        );
    }
);

mergePatchPairs();
