tutorials/pimpleHFDIBFoam/Immersed-BeamBend/Embedded_Beam_Re20_2D-Mesh24720/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         8;

deltaT          0.01;

writeControl    timeStep;
writeInterval   20;

purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;


functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");

        writeControl    timeStep;
        writeInterval   10;

        patches         (rectBlock);

        pName           p;
        UName           U;

        rho             rhoInf;
        rhoInf          1000;

        CofR            (12.0 1.01475 0.0);
        log             true;
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");

        writeControl    timeStep;
        writeInterval   10;

        patches         (rectBlock);

        pName           p;
        UName           U;

        rho             rhoInf;
        rhoInf          1000;

        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);

        CofR            (12.0 1.01475 0.0);

        // Keep this consistent with inlet mean velocity
        magUInf         1.0;

        // Reference length = moving patch height
        lRef            2.0295;

        // Reference area = D * span = 2.0295 * 0.1
        Aref            0.20295;

        log             true;
    }
}
