tutorials/pimpleHFDIBFoam/Immersed-BeamBend/Embedded_Beam_Re20_2D-Mesh24720/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    cellDisplacement
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.0;
        smoother        GaussSeidel;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.05;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.0;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-9;
        relTol          0.05;
    }

    UFinal
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor         yes;
    nOuterCorrectors          2;
    nCorrectors               2;
    nNonOrthogonalCorrectors  0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
        pcorr           0.3;
    }

    equations
    {
        U               0.7;
        cellDisplacement 0.7;
    }
}
